[
    {
        "title": "Assassin's Creed",
        "posterLink": "https://static.wikia.nocookie.net/assassinscreed/images/6/6a/Accover.jpg/revision/latest/scale-to-width-down/350?cb=20191130041242",
        "developer": "Ubisoft Montreal",
        "platforms": [
            "PlayStation 3",
            "Xbox 360",
            "Microsoft Windows"
        ],
        "description" : "Assassin's Creed is a 2007 sandbox style action-adventure-stealth video game developed by Ubisoft Montreal and published by Ubisoft. The game was released for the Xbox 360 and PlayStation 3 in November 2007 and for PC in April 2008. The game centers around the use of a machine dubbed the 'Animus', which allows its user to view the genetic memories of his or her ancestors, centering around the protagonist, a bartender named Desmond Miles. As Desmond relives the memories of one of his ancestors, the Assassin Altaïr Ibn-La'Ahad who lived in the Holy Land during the Third Crusade, details of a battle between two ancient sects – the Knights Templar and the Assassin Order – emerge as both scour for an artifact known only as a 'Piece of Eden'. Assassin's Creed received primarily positive reviews, for both its story and its gameplay, and received several awards at 2006's E3. In November 2009, a sequel in the form of Assassin's Creed II was released, building on the foundation set by Assassin's Creed"
    },
    {
        "title": "Assassin's Creed II",
        "posterLink": "https://static.wikia.nocookie.net/assassinscreed/images/0/09/AC2coverHighRes.jpg/revision/latest/scale-to-width-down/350?cb=20120706023159",
        "developer": "",
        "platforms": [
            "PlayStation 3",
            "Xbox 360",
            "Microsoft Windows",
            "Mac OS X",
            "PlayStation 4",
            "Xbox One"
        ],
        "description" : "Assassin's Creed II is a 2009 video game developed by Ubisoft Montreal and published by Ubisoft. It was released on 17 November 2009 (US), 19 November 2009 (AU) and 20 November 2009 (worldwide) on PlayStation 3 and Xbox 360. The PC version was released on 6 March 2010 (UK) and 9 March 2010 (US). A direct sequel to Assassin's Creed, the game focuses again on Desmond Miles after he escapes from Abstergo Industries with the help of employee Lucy Stillman. In an attempt to thwart Abstergo and the modern-day Templars, Desmond uses a new Animus to relive the genetic memories of his ancestor, Ezio Auditore da Firenze, who lived in Italy during the Renaissance. The player controls Desmond to a degree, but primarily Ezio, who becomes an Assassin after his family is betrayed. While controlling Ezio, the player can explore renditions of major Italian regions and cities through a mixture of action, stealth, and economic gameplay. On 16 November 2010, a follow-up in the form of Assassin's Creed: Brotherhood was released, expanding on both Ezio's life and the modern day storyline. A remastered version of the game was released for the PlayStation 4 and Xbox One as part of The Ezio Collection in November 2018."
    },
    {
        "title": "Assassin's Creed: Brotherhood",
        "posterLink": "https://static.wikia.nocookie.net/assassinscreed/images/2/2a/Assassins_Creed_brotherhood_cover.jpg/revision/latest/scale-to-width-down/350?cb=20200128141604",
        "developer": "",
        "platforms": [
            "PlayStation 3",
            "Xbox 360",
            "Microsoft Windows",
            "Mac OS X",
            "PlayStation 4",
            "Xbox One"
        ],
        "description": "Assassin's Creed: Brotherhood is a 2010 video game and the direct sequel of 2009's Assassin's Creed II, picking up right after the conclusion of the previous game. The story once again features Ezio Auditore da Firenze, now a legendary Master Assassin, as he strives to rebuild the Assassin Brotherhood in Rome, by bringing down the tyrannical Templar family, the Borgia, and bringing the city into the true wealth and wonder of the Renaissance. A sequel for Brotherhood was announced in May 2011, entitled Assassin's Creed: Revelations, and was released in November of the same year. A remastered version of the game was later released as part of The Ezio Collection."
    },
    {
        "title": "Assassin's Creed: Revelations",
        "posterLink": "https://static.wikia.nocookie.net/assassinscreed/images/5/51/ACR_Boxart.jpg/revision/latest/scale-to-width-down/350?cb=20110703195808",
        "developer": "Ubisoft Montreal",
        "platforms": [
            "PlayStation 3",
            "Xbox 360",
            "Microsoft Windows",
            "PlayStation 4",
            "Xbox One"
        ],
        "description": "Assassin's Creed: Revelations is a 2011 video game published by Ubisoft and was developed by its subsidiary, Ubisoft Montreal. A direct sequel and follow-up to 2010's Assassin's Creed: Brotherhood, Revelations is the fourth main installment of the series. Revelations continues the story of Desmond Miles, who has fallen into a coma due to the events of the previous game. In order for him to awaken again, Desmond must relive the last significant memories of his ancestor, the Assassin Mentor Ezio Auditore da Firenze, who sought out the secret library of the Mentor of the Levantine Assassins, Altaïr Ibn-La'Ahad, in 1511. A sequel to Revelations was announced in March 2012, entitled Assassin's Creed III, and was released in October of the same year. A remastered version of the game was later released as part of The Ezio Collection."
    },
    {
        "title": "Assassin's Creed III",
        "posterLink": "https://static.wikia.nocookie.net/assassinscreed/images/e/ec/Assassin%27s_Creed_III_Cover.jpg/revision/latest/scale-to-width-down/350?cb=20120812182759",
        "developer": "Ubisoft Montreal",
        "platforms": [
            "PlayStation 3",
            "Xbox 360",
            "Wii U",
            "Microsoft Windows",
            "PlayStation 4",
            "Xbox One",
            "Nintendo Switch"
        ],
        "description": "Assassin's Creed III is a 2012 sandbox style action-adventure video game that is developed by Ubisoft Montreal and published by Ubisoft. It is the fifth main title in the Assassin's Creed series, and is a direct sequel to Assassin's Creed: Revelations. The game tells the stories of Haytham Kenway and Ratonhnhaké:ton, set in the American Northeast from 1754 - 1783, during the French and Indian and American Revolutionary Wars. It also concludes the modern-day story of their descendant Desmond Miles. Assassin's Creed III was released for Xbox 360 and PS3 on 30 October in the United States and 31 October in Europe and Australia, while the PC version was released on 20 November for the United States and 23 November in Europe.[1][2] The game was also released for the Wii U in North America on 18 November. On 28 February 2013, Ubisoft announced the game's sequel, titled Assassin's Creed IV: Black Flag. It was released on 29 October 2013. A remastered version of the game was released for Xbox One, PS4 and PC on 29 March 2019; and the Nintendo Switch version was released on 21 May 2019."
    },
    {
        "title": "Assassin's Creed IV: Black Flag",
        "posterLink": "https://static.wikia.nocookie.net/assassinscreed/images/6/6d/Assassin%27s_Creed_IV_Black_Flag.jpg/revision/latest/scale-to-width-down/350?cb=20130904164224",
        "developer": "Ubisoft Montreal",
        "platforms": [
            "PlayStation 3",
            "Xbox 360",
            "Wii U",
            "PlayStation 4",
            "Microsoft Windows",
            "Xbox One",
            "Nintendo Switch"
        ],
        "description": "Assassin's Creed IV: Black Flag is a 2013 action-adventure game, and the sixth main installment in the Assassin's Creed series. A sequel to 2012's Assassin's Creed III, the game has the player take on the role of an Abstergo Entertainment research analyst as they explore the story of Edward Kenway – father to Haytham Kenway, grandfather to Ratonhnhaké:ton, and an ancestor of Desmond Miles. Assassin's Creed IV: Black Flag is set primarily on and around the islands in the Caribbean Sea during the Golden Age of Piracy in the early 18th century, with the three major cities consisting of Havana, Nassau, and Kingston. On September 4, 2019, it was announced that Black Flag, along with Rogue would be released together on the Nintendo Switch as a compilation known as Assassin's Creed: The Rebel Collection"
    },
    {
        "title": "Assassin's Creed: Rogue",
        "posterLink": "https://static.wikia.nocookie.net/assassinscreed/images/e/e5/Assassin%27s_Creed_Rogue_-_Cover_Art.jpeg/revision/latest/scale-to-width-down/350?cb=20140809155555",
        "developer": "Ubisoft Sofia",
        "platforms": [
            "PlayStation 3",
            "Xbox 360",
            "Microsoft Windows",
            "PlayStation 4",
            "Xbox One",
            "Nintendo Switch"
        ],
        "description": "Assassin's Creed: Rogue is an open-world action adventure game, released for the PlayStation 3 and Xbox 360 on 11 November 2014 in the United States, 13 November globally, and 10 March 2015 for the PC. Rogue follows the story of the Assassin-turned-Templar Shay Cormac between 1752 and 1760, during the Seven Years' War, and is the closing chapter in the Kenway saga. A remastered version of the game was later globally released for Xbox One and PS4 on 20 March, 2018."
    },
    {
        "title": "Assassin's Creed: Unity",
        "posterLink": "https://static.wikia.nocookie.net/assassinscreed/images/0/0b/Assassin%27s_Creed_Unity_Cover.jpg/revision/latest/scale-to-width-down/350?cb=20140610082722",
        "developer": "Ubisoft Montreal",
        "platforms": [
            "Microsoft Windows",
            "PlayStation 4",
            "Xbox One"
        ],
        "description": "Assassin's Creed: Unity is a 2014 sandbox action adventure game, and a sequel to 2013's Assassin's Creed IV: Black Flag, the game has the player take on the role of an Initiate as they explore the story of Arno Dorian, who joins the Assassins to investigate the murder of his adoptive father on behalf of his adoptive sister Élise de la Serre, a member of the Templars. The game was released on 11 November 2014 in North America, 13 November in Europe and 14 November in the UK. It is available for PlayStation 4, Xbox One, and PC. Assassin's Creed: Unity is set primarily in Paris during the French Revolution in the late 18th century, with two additional areas in Versailles and Saint-Denis."
    },
    {
        "title": "Assassin's Creed: Syndicate",
        "posterLink": "https://static.wikia.nocookie.net/assassinscreed/images/c/c2/ACS_Box_art_icon.jpg/revision/latest/scale-to-width-down/350?cb=20150512162954",
        "developer": "Ubisoft Quebec",
        "platforms": [
            "PlayStation 4",
            "Xbox One",
            "Microsoft Windows"
        ],
        "description": "Assassin's Creed: Syndicate is the ninth main installment in the Assassin's Creed series. The conceptual title and screenshots of the game were first leaked on 2 December 2014, following which Ubisoft acknowledged the leaked assets about Victory as genuine. The game was released on 23 October 2015 worldwide on PlayStation 4 and Xbox One, while the PC version released on 19 November 2015. The game has the player take on the role of an Initiate as they explore the story of the twin protagonists, Jacob and Evie Frye, both of whom are playable. The two arrive in London in 1868, as the Industrial Revolution reaches its climax, bringing its lot of inequality and poverty in a city controlled by the Templars. To stop their rule, the Fryes will take over the organized crime in an effort to gather an army and free London. Assassin's Creed: Syndicate is set primarily in 19th century London, during the Victorian era."
    },
    {
        "title": "Assassin's Creed: Origins",
        "posterLink": "https://static.wikia.nocookie.net/assassinscreed/images/2/2f/ACOrigins_cover.jpg/revision/latest/scale-to-width-down/350?cb=20200127122455",
        "developer": "Ubisoft Montreal",
        "platforms": [
            "Microsoft Windows",
            "PlayStation 4",
            "Xbox One"
        ],
        "description": "Assassin's Creed: Origins is the tenth main installment in the Assassin's Creed series developed by Ubisoft. The game was released worldwide on October 27, 2017. The player takes on the role of a Medjay named Bayek and his wife Aya, as they work to protect the people of the Ptolemaic Kingdom during a time of widespread upheaval: the Pharaoh, Ptolemy XIII, struggles to maintain his rule whilst harbouring ambitions of expanding his kingdom; his sister, the recently deposed Cleopatra, begins marshalling loyalist forces to launch a counter-coup against Ptolemy; and frequent incursions into the Kingdom by the Roman Republic under the command of Julius Caesar lead to fears of an imminent invasion. Bayek's role as a Medjay brings him and Aya into contact with the secretive forces manipulating these events and into becoming the first Assassins."
    },
    {
        "title": "Assassin's Creed: Odyssey",
        "posterLink": "https://static.wikia.nocookie.net/assassinscreed/images/f/f5/Assassin%27s_Creed_Odyssey.jpg/revision/latest/scale-to-width-down/333?cb=20191102035347",
        "developer": "Ubisoft Québec[note 1]",
        "platforms": [
            "Microsoft Windows",
            "PlayStation 4",
            "Xbox One",
            "Nintendo Switch (JP only)",
            "Stadia"
        ],
        "description": "Assassin's Creed: Odyssey is the eleventh main installment in the Assassin's Creed series developed by Ubisoft. The game's genetic memory story is set in 431 BCE, recounting the secret history of the Peloponnesian War, fought between the city-states of ancient Greece. The protagonist is a mercenary named either Alexios or Kassandra (selectable) who can choose to fight for either Athens and the Delian League or Sparta and the Peloponnesian League, as well as against the Cult of Kosmos. The modern day segments will again follow Layla Hassan, who was first introduced in Assassin's Creed Origins, and her story will touch on the Isu."
    },
    {
        "title": "Assassin's Creed: Valhalla",
        "posterLink": "https://static.wikia.nocookie.net/assassinscreed/images/6/65/AC_Valhalla_cover.jpg/revision/latest/scale-to-width-down/333?cb=20200430195147",
        "developer": "Ubisoft Montreal",
        "platforms": [
            "Microsoft Windows",
            "PlayStation 4",
            "PlayStation 5",
            "Xbox One",
            "Xbox Series X/S",
            "Google Stadia"
        ],
        "description": "Assassin's Creed: Valhalla is the twelfth main installment in the Assassin's Creed series developed by Ubisoft. In the game, the player takes control of Eivor, a Viking who fought in the Norse invasion of England."
    }
]