[
    {
        "title": "God of War",
        "posterLink": "https://static.wikia.nocookie.net/godofwar/images/0/0c/Gowbox.jpg/revision/latest/scale-to-width-down/310?cb=20070810202820",
        "developer": "",
        "platforms": [
            "PlayStation 2",
            "PlayStation 3",
            "PlayStation Vita"
        ],
        "description" : "God of War is a video game for the Sony PS2 console released on March 22, 2005. As an action-adventure game heavily influenced by Greek mythology, God of War was developed by Sony Computer Entertainment's Santa Monica division. it is set in ancient Greece with vengeance as its central motif. The player controls the protagonist Kratos, a Spartan warrior who serves the Olympian Gods. The goddess Athena tasks Kratos with killing Ares, the God of War and Kratos' former mentor who tricked Kratos into killing his wife and daughter. As Ares besieges Athens out of hatred for Athena, Kratos embarks on a quest to find the one object capable of stopping the god once and for all: Pandora's Box. "
    },
    {
        "title": "God of War II",
        "posterLink": "https://static.wikia.nocookie.net/godofwar/images/d/d4/God_of_War_II_NTSC.jpg/revision/latest/scale-to-width-down/310?cb=20110110131430",
        "developer": "SCE Santa Monica Studio",
        "platforms": [
            "PlayStation 2",
            "PlayStation 3",
            "PlayStation Vita"
        ],
        "description" : "God of War II is an action-adventure game developed by Santa Monica Studio and published by Sony Computer Entertainment (SCE). First released for the PlayStation 2 console on March 13, 2007, it is the second installment in the God of War series, the sixth chronologically, and the sequel to 2005's God of War. The game is based on Greek mythology and set in ancient Greece, with vengeance as its central motif. The player character is protagonist Kratos, the new God of War who killed the former, Ares. Kratos is betrayed by Zeus, the King of the Olympian Gods, who strips him of his godhood and kills him. Slowly dragged to the Underworld, he is saved by the Titan Gaia, who instructs him to find the Sisters of Fate, as they can allow him to travel back in time, avert his betrayal, and take revenge on Zeus. God of War II won a Golden Joystick for 'PlayStation Game of the Year 2007' at the 2007 Golden Joystick Awards."
    },
    {
        "title": "God of War: Chains of Olympus",
        "posterLink": "https://static.wikia.nocookie.net/godofwar/images/e/ef/938607_85521.jpg/revision/latest/scale-to-width-down/290?cb=20100104235442",
        "developer": "Ready at DawnSCE Santa Monica Studio",
        "platforms": [
            "PlayStation Portable"
        ],
        "description" : "God of War: Chains of Olympus for PSP is a video game developed by Ready at Dawn Studios in 2008. It was the first game in the series to be released for the PSP, the second being Ghost of Sparta. It is a prequel to the video game God of War and takes place after God of War: Ascension. The game takes place in the period in which Kratos served the Gods of Olympus for ten years. Over the years, Kratos had to complete several goals in order to achieve redemption for the nightmares that haunt him."
    },
    {
        "title": "God of War III",
        "posterLink": "https://static.wikia.nocookie.net/godofwar/images/c/c4/God-of-war-3-box-art-2-.jpg/revision/latest/scale-to-width-down/310?cb=20110625024853",
        "developer": "SCE Santa Monica StudioPS4",
        "platforms": [
            "PlayStation 3",
            "PlayStation 4"
        ],
        "description" : "God of War III is an action-adventure game developed by Santa Monica Studio and published by Sony Computer Entertainment (SCE). Released for the PlayStation 3 (PS3) console on March 16, 2010, the game is the fifth installment in the God of War series, the final chapter of the greek era of the series, the seventh game chronologically, and the sequel to 2007's God of War II. Loosely based on Greek mythology, the game is set in ancient Greece with vengeance as its central motif. The player controls the protagonist and former God of War Kratos, after his betrayal at the hands of his father Zeus, King of the Olympian gods. Reigniting the Great War, Kratos ascends Mount Olympus until he is abandoned by the Titan Gaia. Guided by Athena’s spirit, Kratos battles monsters, gods, and Titans in a search for Pandora, without whom he cannot open Pandora's Box, defeat Zeus, and end the reign of the Olympian gods."
    },
    {
        "title": "God of War: Ghost of Sparta",
        "posterLink": "https://static.wikia.nocookie.net/godofwar/images/4/4a/Ghost_of_Sparta_--_Alternate_Box_Art.jpg/revision/latest/scale-to-width-down/290?cb=20100907091758",
        "developer": "Ready at DawnSCE Santa Monica Studio",
        "platforms": [
            "PlayStation Portable"
        ],
        "description" : "God of War: Ghost of Sparta is the sixth installment of the God of War series, originally released on the PlayStation Portable and the PSP Go. It was later released along with God of War: Chains of Olympus on the PlayStation 3 as part of the God of War: Origins Collection. The story is set between God of War and God of War II and has Kratos visiting the long-lost city of Atlantis and also details more about his past, which he seeks to unravel and also learns that his long-lost mother and brother Deimos are alive."
    },
    {
        "title": "God of War: Ascension",
        "posterLink": "https://static.wikia.nocookie.net/godofwar/images/d/d9/Godofwarascensionfinalboxart.jpg/revision/latest/scale-to-width-down/310?cb=20130118160704",
        "developer": "SCE Santa Monica Studio",
        "platforms": [
            "PlayStation 3"
        ],
        "description" : "God of War: Ascension is the seventh installment in the popular God of War series, released on March 12, 2013. Chronologically, it serves as the first chapter in the series, forming part of a saga with vengeance as a central theme. The game predates Kratos' entire reign as the god of war, and features a timeline roughly six months after Kratos' unintentional killing of his wife and daughter. Flashbacks also occur, seeing as how this timeline follows his allegiance to Ares, which was already addressed in the original God of War, which takes place ten years after the events of Ascension. It marks a new chapter in Kratos' story, as its listing notes to 'Join Kratos as he takes his first steps on a now legendary quest for freedom, redemption, and the clarity to avenge his family in the most ambitious God of War adventure in the series so far.'"
    },
    {
        "title": "God of War (2018)",
        "posterLink": "https://static.wikia.nocookie.net/godofwar/images/a/a7/God_of_War_4_cover.jpg/revision/latest/scale-to-width-down/310?cb=20170614023116",
        "developer": "SIE Santa Monica Studio",
        "platforms": ["PlayStation 4"],
        "description" : "God of War (also known as God of War IV) is the sequel to God of War III as well as a continuation of the canon God of War chronology. God of War is the eighth installment in the franchise overall. Unlike previous installments, this game focuses on Norse mythology and follows an older and more seasoned Kratos and his new son Atreus in the years since God of War III. The game released on April 20, 2018, and is exclusive to the PlayStation 4. A sequel, God of War: Ragnarök, is in development. Many years have passed since Kratos took his vengeance against the Olympian gods. Having survived his final encounter with his father Zeus, Kratos has since travelled to Midgard in Ancient Norway and now lives with his young son Atreus in the world of the Norse gods, a savage land inhabited by many ferocious monsters and warriors. In order to teach his son, whose mother (and Kratos's second wife) has recently died, how to survive in such a world, Kratos must master the rage that has driven him for many years and embrace his newfound role as a father and a mentor."
    }
]